app/views/songs/_form.html.erb

  <br />
    <%= f.select :artist_id, options_from_collection_for_select(Artist.all, :id, :name) %>
---
SELECT "artists".* FROM "artists"